abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_uart_driver.c
    /* Compute divider. */
    FLEXIO_UART_DRV_ComputeBaudRateDivider(state, userConfigPtr->baudRate, &divider, inputClock);
    bits = userConfigPtr->bitCount;

    /* Configure rx shifter */
    FLEXIO_HAL_SetShifterConfig(baseAddr,
                                RX_SHIFTER(resourceIndex),
                                FLEXIO_SHIFTER_START_BIT_0,
                                FLEXIO_SHIFTER_STOP_BIT_1,
                                FLEXIO_SHIFTER_SOURCE_PIN);
    FLEXIO_HAL_SetShifterControl(baseAddr,
                                 RX_SHIFTER(resourceIndex),
                                 FLEXIO_SHIFTER_MODE_RECEIVE,
                                 userConfigPtr->dataPin,             /* input from rx pin */
                                 FLEXIO_PIN_POLARITY_HIGH,
                                 FLEXIO_PIN_CONFIG_DISABLED,
                                 RX_TIMER(resourceIndex),
                                 FLEXIO_TIMER_POLARITY_NEGEDGE);

    /* Configure rx timer */
    FLEXIO_HAL_SetTimerCompare(baseAddr, RX_TIMER(resourceIndex), (((bits << 1U) - 1U) << 8U) + divider);
    FLEXIO_HAL_SetTimerConfig(baseAddr, 
                              RX_TIMER(resourceIndex),
                              FLEXIO_TIMER_START_BIT_ENABLED,
                              FLEXIO_TIMER_STOP_BIT_TIM_DIS,
                              FLEXIO_TIMER_ENABLE_PIN_POSEDGE,         /* enable when data is available */
                              FLEXIO_TIMER_DISABLE_TIM_CMP,
                              FLEXIO_TIMER_RESET_PIN_RISING,
                              FLEXIO_TIMER_DECREMENT_CLK_SHIFT_TMR,    /* decrement on FlexIO clock */
                              FLEXIO_TIMER_INITOUT_ONE_RESET);
    FLEXIO_HAL_SetTimerControl(baseAddr,
                               RX_TIMER(resourceIndex),
                               0U,                                      /* trigger unused */
                               FLEXIO_TRIGGER_POLARITY_HIGH,
                               FLEXIO_TRIGGER_SOURCE_EXTERNAL,
                               userConfigPtr->dataPin,                   /* input from rx pin */
                               FLEXIO_PIN_POLARITY_LOW,
                               FLEXIO_PIN_CONFIG_DISABLED,
                               FLEXIO_TIMER_MODE_8BIT_BAUD);

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_EndTransfer
 * Description   : End the current transfer
 *
 *END**************************************************************************/
static void FLEXIO_UART_DRV_EndTransfer(flexio_uart_state_t *state)
{
    FLEXIO_Type *baseAddr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */

    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;

    /* Disable transfer engine */
    switch (state->driverType)
    {
        case FLEXIO_DRIVER_TYPE_INTERRUPTS:
            /* Disable interrupts for Rx / Tx shifter */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, (1U << TX_SHIFTER(resourceIndex)), false);
            FLEXIO_HAL_SetShifterErrorInterrupt(baseAddr, (1U << TX_SHIFTER(resourceIndex)), false);
            /* disable timer interrupt  */
            FLEXIO_HAL_SetTimerInterrupt(baseAddr, (1U << TX_TIMER(resourceIndex)), false);
            break;
        case FLEXIO_DRIVER_TYPE_POLLING:
            /* Nothing to do here */
            break;
        case FLEXIO_DRIVER_TYPE_DMA:
            /* for Tx we need to disable timer interrupt */
            FLEXIO_HAL_SetTimerInterrupt(baseAddr, (1U << TX_TIMER(resourceIndex)), false);
            /* Disable the FlexIO DMA request */
            FLEXIO_HAL_SetShifterDMARequest(baseAddr, (1U << TX_SHIFTER(resourceIndex)), false);
            /* Release the DMA channel */
            (void)EDMA_DRV_ReleaseChannel(&(state->dmaChannel));
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    state->driverIdle = true;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_StopTransfer
 * Description   : Forcefully stops the current transfer
 *
 *END**************************************************************************/
static void FLEXIO_UART_DRV_StopTransfer(flexio_uart_state_t *state)
{
    FLEXIO_Type *baseAddr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */


    resourceIndex = state->flexioCommon.resourceIndex;
    baseAddr = g_flexioBase[state->flexioCommon.instance];

    /* disable and re-enable timers and shifters to reset them */
    FLEXIO_HAL_SetShifterMode(baseAddr, TX_SHIFTER(resourceIndex), FLEXIO_SHIFTER_MODE_DISABLED);
    FLEXIO_HAL_SetTimerMode(baseAddr, TX_TIMER(resourceIndex), FLEXIO_TIMER_MODE_DISABLED);

    /* clear any leftover error flags */
    FLEXIO_HAL_ClearShifterErrorStatus(baseAddr, TX_SHIFTER(resourceIndex));

    /* end the transfer */
    FLEXIO_UART_DRV_EndTransfer(state);

    /* re-enable timers and shifters */
    if (state->direction == FLEXIO_UART_DIRECTION_TX)
    {
        FLEXIO_HAL_SetShifterMode(baseAddr, TX_SHIFTER(resourceIndex), FLEXIO_SHIFTER_MODE_TRANSMIT);
    }
    else
    {
        FLEXIO_HAL_SetShifterMode(baseAddr, RX_SHIFTER(resourceIndex), FLEXIO_SHIFTER_MODE_RECEIVE);
    }
    FLEXIO_HAL_SetTimerMode(baseAddr, TX_TIMER(resourceIndex), FLEXIO_TIMER_MODE_8BIT_BAUD);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_WaitTransferEnd
 * Description   : waits for the end of a blocking transfer
 *
 *END**************************************************************************/
static flexio_status_t FLEXIO_UART_DRV_WaitTransferEnd(flexio_uart_state_t *state, uint32_t timeout)
{
    osif_status_t osifError = OSIF_STATUS_SUCCESS;

    switch (state->driverType)
    {
        case FLEXIO_DRIVER_TYPE_INTERRUPTS:
            /* Wait for transfer to be completed by the IRQ */
            osifError = OSIF_SemaWait(&(state->idleSemaphore), timeout);
            break;
        case FLEXIO_DRIVER_TYPE_POLLING:
            /* Call FLEXIO_UART_DRV_GetStatus() to do the transfer */
            while (FLEXIO_UART_DRV_GetStatus(state, NULL) == FLEXIO_STATUS_BUSY);
            break;
        case FLEXIO_DRIVER_TYPE_DMA:
            /* Wait for transfer completion to be signaled by the DMA or IRQ */
            osifError = OSIF_SemaWait(&(state->idleSemaphore), timeout);
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }
    if (osifError == OSIF_STATUS_TIMEOUT)
    {
        /* abort current transfer */
        state->status = FLEXIO_STATUS_TIMEOUT;
        FLEXIO_UART_DRV_StopTransfer(state);
    }

    /* blocking transfer is over */
    state->blocking = false;
    return state->status;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_ReadData
 * Description   : reads data received by the module
 *
 *END**************************************************************************/
static void FLEXIO_UART_DRV_ReadData(flexio_uart_state_t *state)
{
    FLEXIO_Type *baseAddr;
    uint32_t data;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state->remainingBytes > 0U);
    DEV_ASSERT(state->data != NULL);
#endif
    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;

    /* Read data from shifter buffer */
    data = FLEXIO_HAL_ReadShifterBuffer(baseAddr, RX_SHIFTER(resourceIndex), FLEXIO_SHIFTER_RW_MODE_NORMAL);
    data >>= 32U - (uint32_t)(state->bitCount);

    if (state->bitCount <= 8U)
    {
        *(uint8_t *)state->data = (uint8_t)data;
        /* Update rx buffer pointer and remaining bytes count */
        state->data += 1U;
        state->remainingBytes -= 1U;
    }
    else
    {
        /* for more than 8 bits per word 2 bytes are needed */
        *(uint16_t *)state->data = (uint16_t)data;
        /* Update rx buffer pointer and remaining bytes count */
        state->data += 2U;
        state->remainingBytes -= 2U;
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_WriteData
 * Description   : writes data to be transmitted by the module
 *
 *END**************************************************************************/
static void FLEXIO_UART_DRV_WriteData(flexio_uart_state_t *state)
{
    FLEXIO_Type *baseAddr;
    uint32_t data;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */


#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state->data != NULL);
#endif
    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;

