abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_uart_driver.c
    if (state->remainingBytes == 0U)
    {
        /* Done transmitting */
        return;
    }
    /* Read data from user buffer and update tx buffer pointer and remaining bytes count */
    if (state->bitCount <= 8U)
    {
        data = (uint32_t)(*(uint8_t *)state->data);
        state->data += 1U;
        state->remainingBytes -= 1U;
    }
    else
    {
        /* for more than 8 bits per word 2 bytes are needed */
        data = (uint32_t)(*(uint16_t *)state->data);
        state->data += 2U;
        state->remainingBytes -= 2U;
    }

    FLEXIO_HAL_WriteShifterBuffer(baseAddr, TX_SHIFTER(resourceIndex), data, FLEXIO_SHIFTER_RW_MODE_NORMAL);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_CheckStatusTx
 * Description   : Check status of the UART transmission. This function can be 
 *                 called either in an interrupt routine or directly in polling 
 *                 mode to advance the transfer.
 *
 *END**************************************************************************/
static void FLEXIO_UART_DRV_CheckStatusTx(void *stateStruct)
{
    FLEXIO_Type *baseAddr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */
    flexio_uart_state_t *state;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(stateStruct != NULL);
#endif

    state = (flexio_uart_state_t *)stateStruct;
    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;

    /* No need to check for Tx underflow since timer is controlled by the shifter status flag */
    /* Check for transfer end */
    if ((state->remainingBytes == 0U) && FLEXIO_HAL_GetTimerStatus(baseAddr, TX_TIMER(resourceIndex)))
    {
        /* Clear timer status */
        FLEXIO_HAL_ClearTimerStatus(baseAddr, TX_TIMER(resourceIndex));
        if (FLEXIO_HAL_GetShifterStatus(baseAddr, TX_SHIFTER(resourceIndex)))
        {
            /* Record success if there was no error */
            if (state->status == FLEXIO_STATUS_BUSY)
            {
                state->status = FLEXIO_STATUS_SUCCESS;
            }
            FLEXIO_UART_DRV_EndTransfer(state);
            /* Call callback to announce the end transfer event to the user */
            if (state->callback != NULL)
            {
                state->callback(state, FLEXIO_EVENT_END_TRANSFER, state->callbackParam);
            }
            /* Signal transfer end for blocking transfers */
            if (state->blocking == true)
            {
                (void)OSIF_SemaPost(&(state->idleSemaphore));
            }
        }
    }
    /* Check if transmitter needs more data */
    else if (FLEXIO_HAL_GetShifterStatus(baseAddr, TX_SHIFTER(resourceIndex)) && (state->remainingBytes > 0U))
    {
        FLEXIO_UART_DRV_WriteData(state);
        if (state->remainingBytes == 0U)
        {
            /* Out of data, call callback to allow user to provide a new buffer */
            if (state->callback != NULL)
            {
                state->callback(state, FLEXIO_EVENT_TX_EMPTY, state->callbackParam);
            }
        }
        if ((state->remainingBytes == 0U) && (state->driverType == FLEXIO_DRIVER_TYPE_INTERRUPTS))
        {
            /* transmission completed; disable interrupt */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, (1U << TX_SHIFTER(resourceIndex)), false);
            /* enable timer interrupt to ensure that transfer is completed */
            FLEXIO_HAL_SetTimerInterrupt(baseAddr, (1U << TX_TIMER(resourceIndex)), true);
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_CheckStatusRx
 * Description   : Check status of the UART reception. This function can be 
 *                 called either in an interrupt routine or directly in polling 
 *                 mode to advance the transfer.
 *
 *END**************************************************************************/
static void FLEXIO_UART_DRV_CheckStatusRx(void *stateStruct)
{
    FLEXIO_Type *baseAddr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */
    flexio_uart_state_t *state;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(stateStruct != NULL);
#endif

    state = (flexio_uart_state_t *)stateStruct;
    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;

    /* Check for errors */
    if (FLEXIO_HAL_GetShifterErrorStatus(baseAddr, RX_SHIFTER(resourceIndex)))
    {
        state->status = FLEXIO_STATUS_RX_OVERFLOW;
        FLEXIO_HAL_ClearShifterErrorStatus(baseAddr, RX_SHIFTER(resourceIndex));
        state->remainingBytes = 0U;
        /* Continue processing events */
    }
    /* Check if data was received */
    else if (FLEXIO_HAL_GetShifterStatus(baseAddr, RX_SHIFTER(resourceIndex)))
    {
        FLEXIO_UART_DRV_ReadData(state);
        if (state->remainingBytes == 0U)
        {
            /* Out of data, call callback to allow user to provide a new buffer */
            if (state->callback != NULL)
            {
                state->callback(state, FLEXIO_EVENT_RX_FULL, state->callbackParam);
            }
        }
    }
    /* Check if transfer is over */
    if (state->remainingBytes == 0U)
    {
        /* Record success if there was no error */
        if (state->status == FLEXIO_STATUS_BUSY)
        {
            state->status = FLEXIO_STATUS_SUCCESS;
        }
        /* End transfer */
        FLEXIO_UART_DRV_EndTransfer(state);
        /* Call callback to announce the event to the user */
        if (state->callback != NULL)
        {
            state->callback(state, FLEXIO_EVENT_END_TRANSFER, state->callbackParam);
        }
        /* Signal transfer end for blocking transfers */
        if (state->blocking == true)
        {
            (void)OSIF_SemaPost(&(state->idleSemaphore));
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_CheckStatus
 * Description   : Check status of the UART transfer. This function can be 
 *                 called either in an interrupt routine or directly in polling 
 *                 mode to advance the transfer.
 *
 *END**************************************************************************/
void FLEXIO_UART_DRV_CheckStatus(void *stateStruct)
{
    flexio_uart_state_t *state;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(stateStruct != NULL);
#endif

    state = (flexio_uart_state_t *)stateStruct;
    if (state->direction == FLEXIO_UART_DIRECTION_TX)
    {
        FLEXIO_UART_DRV_CheckStatusTx(stateStruct);
    }
    else
    {
        FLEXIO_UART_DRV_CheckStatusRx(stateStruct);
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_EndDmaTxTransfer
 * Description   : function called at the end of a DMA Tx transfer
 *
 *END**************************************************************************/
static void FLEXIO_UART_DRV_EndDmaTxTransfer(void *stateStruct, edma_chn_status_t status)
{
    flexio_uart_state_t *state;
    uint8_t dmaChn;
    DMA_Type *edmaBase;
    uint32_t byteCount;
    FLEXIO_Type *baseAddr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(stateStruct != NULL);
#endif

    (void)status;
    state = (flexio_uart_state_t *)stateStruct;
    baseAddr = g_flexioBase[state->flexioCommon.instance];

    /* Call callback to allow user to provide a new buffer */
    if (state->callback != NULL)
    {
        state->callback(state, FLEXIO_EVENT_TX_EMPTY, state->callbackParam);
    }
    if (state->remainingBytes == 0U)
    {
        /* No more data to transmit, transmission will stop */
        /* enable timer interrupt to let IRQ ensure that transfer is completed */
        FLEXIO_HAL_SetTimerInterrupt(baseAddr, (1U << TX_TIMER(state->flexioCommon.resourceIndex)), true);
    }
    else
    {
        /* There is more data to transfer, restart DMA channel */
        /* Update buffer address and size */
        dmaChn = state->dmaChannel.channel;
        edmaBase = g_edmaBase[0U];
        if (state->bitCount <= 8U)
        {
            byteCount = 1U;
        }
        else
        {
            byteCount = 2U;
        }
        EDMA_HAL_TCDSetSrcAddr(edmaBase, dmaChn, (uint32_t)(state->data));
        EDMA_HAL_TCDSetMajorCount(edmaBase, dmaChn, state->remainingBytes / byteCount);
        /* Now that this tx is set up, clear remaining bytes count */
        state->remainingBytes = 0U;
        /* Start the channel */
        (void)EDMA_DRV_StartChannel(&(state->dmaChannel));
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_EndDmaRxTransfer
 * Description   : function called at the end of a DMA Rx transfer
 *
 *END**************************************************************************/
static void FLEXIO_UART_DRV_EndDmaRxTransfer(void *stateStruct, edma_chn_status_t status)
{
    flexio_uart_state_t *state;
    uint8_t dmaChn;
    DMA_Type *edmaBase;
    uint32_t byteCount;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(stateStruct != NULL);
#endif

    (void)status;
    state = (flexio_uart_state_t *)stateStruct;

    /* Call callback to allow user to provide a new buffer */
    if (state->callback != NULL)
    {
        state->callback(state, FLEXIO_EVENT_RX_FULL, state->callbackParam);
    }
    if (state->remainingBytes == 0U)
    {
        /* No more data to transmit, reception will stop */
        state->status = FLEXIO_STATUS_SUCCESS;
        FLEXIO_UART_DRV_EndTransfer(state);
        /* Call callback to announce the event to the user */
        if (state->callback != NULL)
        {
            state->callback(state, FLEXIO_EVENT_END_TRANSFER, state->callbackParam);
        }
        /* Signal transfer end for blocking transfers */
        if (state->blocking == true)
        {
            (void)OSIF_SemaPost(&(state->idleSemaphore));
        }
    }
    else
    {
        /* There is more data to transfer, restart DMA channel */
        /* Update buffer address and size */
        dmaChn = state->dmaChannel.channel;
        edmaBase = g_edmaBase[0U];
        if (state->bitCount <= 8U)
        {
            byteCount = 1U;
        }
        else
        {
            byteCount = 2U;
        }
        EDMA_HAL_TCDSetDestAddr(edmaBase, dmaChn, (uint32_t)(state->data));
        EDMA_HAL_TCDSetMajorCount(edmaBase, dmaChn, state->remainingBytes / byteCount);
        /* Now that this tx is set up, clear remaining bytes count */
        state->remainingBytes = 0U;
        /* Start the channel */
        (void)EDMA_DRV_StartChannel(&(state->dmaChannel));
    }
}



/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_ComputeTxRegAddr
 * Description   : Computes the address of the register used for DMA tx transfer
 *
 *END**************************************************************************/
static uint32_t FLEXIO_UART_DRV_ComputeTxRegAddr(flexio_uart_state_t *state)
{
    uint32_t addr;
    FLEXIO_Type *baseAddr;
    uint8_t shifter;

    baseAddr = g_flexioBase[state->flexioCommon.instance];
    shifter = TX_SHIFTER(state->flexioCommon.resourceIndex);
    addr = (uint32_t)(&(baseAddr->SHIFTBUF[shifter]));
    return addr;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_ComputeRxRegAddr
 * Description   : Computes the address of the register used for DMA rx transfer
 *
 *END**************************************************************************/
static uint32_t FLEXIO_UART_DRV_ComputeRxRegAddr(flexio_uart_state_t *state)
{
    uint32_t addr;
    FLEXIO_Type *baseAddr;
    uint8_t shifter;
    uint32_t byteCount;

    if (state->bitCount <= 8U)
    {
        byteCount = 1U;
    }
    else
    {
        byteCount = 2U;
    }
    baseAddr = g_flexioBase[state->flexioCommon.instance];
    shifter = RX_SHIFTER(state->flexioCommon.resourceIndex);
    addr = (uint32_t)(&(baseAddr->SHIFTBUF[shifter])) + (sizeof(uint32_t) - byteCount);
    return addr;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_StartTxDmaTransfer
 * Description   : Starts a Tx DMA transfer
 *
 *END**************************************************************************/
static flexio_status_t FLEXIO_UART_DRV_StartTxDmaTransfer(flexio_uart_state_t *state)
{
    dma_request_source_t dmaReq;
    uint32_t instance;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */
    uint8_t dmaChn;
    DMA_Type *edmaBase = g_edmaBase[0U];
    FLEXIO_Type *baseAddr;
    edma_status_t dmaStatus;
    edma_transfer_size_t dmaTransferSize;
    uint32_t byteCount;

    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;
    instance = state->flexioCommon.instance;

    /* Request a DMA channel */
    dmaReq = g_flexioDMASrc[instance][TX_SHIFTER(resourceIndex)];
    dmaStatus = EDMA_DRV_RequestChannel((uint8_t)EDMA_ANY_CHANNEL, dmaReq, &(state->dmaChannel), &dmaChn);
    if (dmaStatus == EDMA_STATUS_FAIL)
    {
        return FLEXIO_STATUS_FAIL;
    }
    /* Configure the transfer control descriptor for the previously allocated channel */
    if (state->bitCount <= 8U)
    {
        dmaTransferSize = EDMA_TRANSFER_SIZE_1B;
        byteCount = 1U;
    }
    else
    {
        dmaTransferSize = EDMA_TRANSFER_SIZE_2B;
        byteCount = 2U;
    }
    (void)EDMA_DRV_ConfigSingleBlockTransfer(&(state->dmaChannel), 
                                             EDMA_TRANSFER_MEM2PERIPH, 
                                             (uint32_t)(state->data),
                                             FLEXIO_UART_DRV_ComputeTxRegAddr(state), 
                                             dmaTransferSize, 
                                             byteCount);
    EDMA_HAL_TCDSetMajorCount(edmaBase, dmaChn, state->remainingBytes / byteCount);
    EDMA_HAL_TCDSetDisableDmaRequestAfterTCDDoneCmd(edmaBase, dmaChn, true);
    /* Now that this transfer is set up, clear remaining bytes count */
    state->remainingBytes = 0U;

    /* Setup callback for DMA tx transfer end */
    (void)EDMA_DRV_InstallCallback(&(state->dmaChannel),
                                   (edma_callback_t)(FLEXIO_UART_DRV_EndDmaTxTransfer),
                                   (void*)(state));
    /* Start tx DMA channel */
    (void)EDMA_DRV_StartChannel(&(state->dmaChannel));

