abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_uart_driver.c
    /* Enable FlexIO DMA requests */
    FLEXIO_HAL_SetShifterDMARequest(baseAddr, (1U << TX_SHIFTER(resourceIndex)), true);

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_StartRxDmaTransfer
 * Description   : Starts an Rx DMA transfer
 *
 *END**************************************************************************/
static flexio_status_t FLEXIO_UART_DRV_StartRxDmaTransfer(flexio_uart_state_t *state)
{
    dma_request_source_t dmaReq;
    uint32_t instance;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */
    uint8_t dmaChn;
    DMA_Type *edmaBase = g_edmaBase[0U];
    FLEXIO_Type *baseAddr;
    edma_status_t dmaStatus;
    edma_transfer_size_t dmaTransferSize;
    uint32_t byteCount;

    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;
    instance = state->flexioCommon.instance;

    /* Request a DMA channel */
    dmaReq = g_flexioDMASrc[instance][TX_SHIFTER(resourceIndex)];
    dmaStatus = EDMA_DRV_RequestChannel((uint8_t)EDMA_ANY_CHANNEL, dmaReq, &(state->dmaChannel), &dmaChn);
    if (dmaStatus == EDMA_STATUS_FAIL)
    {
        return FLEXIO_STATUS_FAIL;
    }
    /* Configure the transfer control descriptor for the previously allocated channel */
    if (state->bitCount <= 8U)
    {
        dmaTransferSize = EDMA_TRANSFER_SIZE_1B;
        byteCount = 1U;
    }
    else
    {
        dmaTransferSize = EDMA_TRANSFER_SIZE_2B;
        byteCount = 2U;
    }
    (void)EDMA_DRV_ConfigSingleBlockTransfer(&(state->dmaChannel), 
                                             EDMA_TRANSFER_PERIPH2MEM, 
                                             FLEXIO_UART_DRV_ComputeRxRegAddr(state), 
                                             (uint32_t)(state->data),
                                             dmaTransferSize, 
                                             byteCount);
    EDMA_HAL_TCDSetMajorCount(edmaBase, dmaChn, state->remainingBytes / byteCount);
    EDMA_HAL_TCDSetDisableDmaRequestAfterTCDDoneCmd(edmaBase, dmaChn, true);
    /* Now that this transfer is set up, clear remaining bytes count */
    state->remainingBytes = 0U;

    /* Setup callback for DMA tx transfer end */
    (void)EDMA_DRV_InstallCallback(&(state->dmaChannel),
                                   (edma_callback_t)(FLEXIO_UART_DRV_EndDmaRxTransfer),
                                   (void*)(state));
    /* Start tx DMA channel */
    (void)EDMA_DRV_StartChannel(&(state->dmaChannel));

    /* Enable FlexIO DMA requests */
    FLEXIO_HAL_SetShifterDMARequest(baseAddr, (1U << RX_SHIFTER(resourceIndex)), true);

    return FLEXIO_STATUS_SUCCESS;
}

/*! @endcond */

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_Init
 * Description   : Initialize the FLEXIO_UART driver
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_Init(uint32_t instance,
                                     const flexio_uart_user_config_t * userConfigPtr,
                                     flexio_uart_state_t * state)
{
    uint32_t inputClock;
    clock_manager_error_code_t clkErr;
    flexio_status_t retCode;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
    /* Check that device was initialized */
    DEV_ASSERT(g_flexioDeviceStatePtr[instance] != NULL);
#endif

    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_flexioClock[instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return FLEXIO_STATUS_FAIL;
    }

    /* Initialize the semaphore */
    if (OSIF_SemaCreate(&(state->idleSemaphore), 0U) == OSIF_STATUS_FAIL)
    {
        return FLEXIO_STATUS_FAIL;
    }

    /* Instruct the resource allocator that we need one shifter/timer */
    state->flexioCommon.resourceCount = 1U;
    /* Common FlexIO driver initialization */
    retCode = FLEXIO_DRV_InitDriver(instance, (flexio_common_state_t *)state);
    if (retCode != FLEXIO_STATUS_SUCCESS)
    {   /* Initialization failed, not enough resources */
        (void)OSIF_SemaDestroy(&(state->idleSemaphore));
        return retCode;
    }

    /* Initialize driver-specific context structure */
    state->data = NULL;
    state->remainingBytes = 0U;
    state->callback = userConfigPtr->callback;
    state->callbackParam = userConfigPtr->callbackParam;
    state->blocking = false;
    state->driverType = userConfigPtr->driverType;
    state->direction = userConfigPtr->direction;
    state->status = FLEXIO_STATUS_SUCCESS;
    state->driverIdle = true;
    state->bitCount = userConfigPtr->bitCount;

    if (state->direction == FLEXIO_UART_DIRECTION_TX)
    {
        /* Configure device for UART Tx mode */
        FLEXIO_UART_DRV_ConfigureTx(state, userConfigPtr, inputClock);
    }
    else
    {
        /* Configure device for UART Rx mode */
        FLEXIO_UART_DRV_ConfigureRx(state, userConfigPtr, inputClock);
    }

    /* Set up transfer engine */
    switch (state->driverType)
    {
        case FLEXIO_DRIVER_TYPE_INTERRUPTS:
            if (state->direction == FLEXIO_UART_DIRECTION_TX)
            {
                state->flexioCommon.isr = FLEXIO_UART_DRV_CheckStatusTx;
            }
            else
            {
                state->flexioCommon.isr = FLEXIO_UART_DRV_CheckStatusRx;
            }
            break;
        case FLEXIO_DRIVER_TYPE_POLLING:
            /* Nothing to do here, FLEXIO_UART_DRV_GetStatus() will handle the transfer */
            break;
        case FLEXIO_DRIVER_TYPE_DMA:
            /* For Tx we will still need interrupt to signal end of transfer */
            if (state->direction == FLEXIO_UART_DIRECTION_TX)
            {
                state->flexioCommon.isr = FLEXIO_UART_DRV_CheckStatusTx;
            }
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_Deinit
 * Description   : De-initialize the FLEXIO_UART driver
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_Deinit(flexio_uart_state_t *state)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
#endif

