abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_uart_driver.c
    /* Check if driver is busy */
    if (!state->driverIdle)
    {
        return FLEXIO_STATUS_BUSY;
    }

    /* Destroy the semaphore */
    (void)OSIF_SemaDestroy(&(state->idleSemaphore));

    return FLEXIO_DRV_DeinitDriver((flexio_common_state_t *)state);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_SetConfig
 * Description   : Set the baud rate and bit width for any subsequent UART transfer
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_SetConfig(flexio_uart_state_t * state, 
                                          uint32_t baudRate, 
                                          uint8_t bitCount)
{
    FLEXIO_Type *baseAddr;
    uint16_t divider;
    uint32_t inputClock;
    clock_manager_error_code_t clkErr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
    DEV_ASSERT(baudRate > 0U);
    DEV_ASSERT(bitCount > 0U);
    DEV_ASSERT(bitCount <= 16U);
    /* for DMA transfers bitCount must 8 */
    DEV_ASSERT(!((state->driverType == FLEXIO_DRIVER_TYPE_DMA) && (bitCount != 8U)));
#endif

    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;

    /* Check if driver is busy */
    if (!state->driverIdle)
    {
        return FLEXIO_STATUS_BUSY;
    }
    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_flexioClock[state->flexioCommon.instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return FLEXIO_STATUS_FAIL;
    }

    /* Compute divider */
    FLEXIO_UART_DRV_ComputeBaudRateDivider(state, baudRate, &divider, inputClock);

    if (state->direction == FLEXIO_UART_DIRECTION_TX)
    {
        /* Configure tx timer */
        FLEXIO_HAL_SetTimerCompare(baseAddr, TX_TIMER(resourceIndex), (((bitCount << 1U) - 1U) << 8U) + divider);
    }
    else
    {
        /* Configure rx timer */
        FLEXIO_HAL_SetTimerCompare(baseAddr, RX_TIMER(resourceIndex), (((bitCount << 1U) - 1U) << 8U) + divider);
    }

    state->bitCount = bitCount;

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_GetBaudRate
 * Description   : Get the currently configured baud rate
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_GetBaudRate(flexio_uart_state_t *state, uint32_t *baudRate)
{
    FLEXIO_Type *baseAddr;
    uint32_t inputClock;
    uint32_t divider;
    uint16_t timerCmp;
    clock_manager_error_code_t clkErr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
#endif

    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;

    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_flexioClock[state->flexioCommon.instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return FLEXIO_STATUS_FAIL;
    }

    /* Get the currently configured divider */
    timerCmp = FLEXIO_HAL_GetTimerCompare(baseAddr, TX_TIMER(resourceIndex));
    divider = (uint32_t)(timerCmp & 0x00FFU);

    /* Compute baud rate: input_clock / (2 * (divider + 1)). Round to nearest integer */
    *baudRate = (inputClock + divider + 1U) / (2U * (divider + 1U));

    return FLEXIO_STATUS_SUCCESS;
}



/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_SendData
 * Description   : Perform a non-blocking UART transmission
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_SendData(flexio_uart_state_t *state,
                                         const uint8_t * txBuff,
                                         uint32_t txSize)
{
    FLEXIO_Type *baseAddr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */
    flexio_status_t retCode;
    flexio_status_t status;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(txSize > 0U);
    DEV_ASSERT(state->direction == FLEXIO_UART_DIRECTION_TX)
#endif

    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;

    /* Check if driver is busy */
    if (!state->driverIdle)
    {
        return FLEXIO_STATUS_BUSY;
    }

    status = state->status;
    state->data = (uint8_t *)txBuff;
    state->remainingBytes = txSize;
    state->status = FLEXIO_STATUS_BUSY;
    state->driverIdle = false;

    /* Enable transfer engine */
    switch (state->driverType)
    {
        case FLEXIO_DRIVER_TYPE_INTERRUPTS:
            /* Enable interrupts for Tx shifter */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, (1U << TX_SHIFTER(resourceIndex)), true);
            FLEXIO_HAL_SetShifterErrorInterrupt(baseAddr, (1U << TX_SHIFTER(resourceIndex)), true);
            break;
        case FLEXIO_DRIVER_TYPE_POLLING:
            /* Call FLEXIO_UART_DRV_CheckStatus once to send the first byte */
            FLEXIO_UART_DRV_CheckStatus(state);
            break;
        case FLEXIO_DRIVER_TYPE_DMA:
            retCode = FLEXIO_UART_DRV_StartTxDmaTransfer(state);
            if (retCode != FLEXIO_STATUS_SUCCESS)
            {
                /* Restore status and idle indicator */
                state->status = status;
                state->driverIdle = true;
                return retCode;
            }
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_SendDataBlocking
 * Description   : Perform a blocking UART transmission
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_SendDataBlocking(flexio_uart_state_t *state,
                                                 const uint8_t * txBuff,
                                                 uint32_t txSize,
                                                 uint32_t timeout)
{
    flexio_status_t status;

    /* mark transfer as blocking */
    if (state->driverType != FLEXIO_DRIVER_TYPE_POLLING)
    {
        state->blocking = true;
    }
    /* Call FLEXIO_UART_DRV_SendData to start transfer */
    status = FLEXIO_UART_DRV_SendData(state, txBuff, txSize);
    if (status != FLEXIO_STATUS_SUCCESS)
    {
        /* Transfer could not be started */
        state->blocking = false;
        return status; 
    }

    /* Wait for transfer to end */
    return FLEXIO_UART_DRV_WaitTransferEnd(state, timeout);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_ReceiveData
 * Description   : Perform a non-blocking UART reception
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_ReceiveData(flexio_uart_state_t *state,
                                                     uint8_t * rxBuff,
                                                     uint32_t rxSize)
{
    FLEXIO_Type *baseAddr;
    uint8_t resourceIndex;    /* Index of first used internal resource instance (shifter and timer) */
    flexio_status_t retCode;
    flexio_status_t status;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(rxSize > 0U);
    DEV_ASSERT(state->direction == FLEXIO_UART_DIRECTION_RX)
#endif

    baseAddr = g_flexioBase[state->flexioCommon.instance];
    resourceIndex = state->flexioCommon.resourceIndex;

