abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_uart_driver.c
    /* Check if driver is busy */
    if (!state->driverIdle)
    {
        return FLEXIO_STATUS_BUSY;
    }

    status = state->status;
    state->data = rxBuff;
    state->remainingBytes = rxSize;
    state->status = FLEXIO_STATUS_BUSY;
    state->driverIdle = false;

    /* Enable transfer engine */
    switch (state->driverType)
    {
        case FLEXIO_DRIVER_TYPE_INTERRUPTS:
            /* Enable interrupts for Rx shifter */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, (1U << RX_SHIFTER(resourceIndex)), true);
            FLEXIO_HAL_SetShifterErrorInterrupt(baseAddr, (1U << RX_SHIFTER(resourceIndex)), true);
            break;
        case FLEXIO_DRIVER_TYPE_POLLING:
            /* Call FLEXIO_UART_DRV_CheckStatus once to send the first byte */
            FLEXIO_UART_DRV_CheckStatus(state);
            break;
        case FLEXIO_DRIVER_TYPE_DMA:
            retCode = FLEXIO_UART_DRV_StartRxDmaTransfer(state);
            if (retCode != FLEXIO_STATUS_SUCCESS)
            {
                /* Restore status and idle indicator */
                state->status = status;
                state->driverIdle = true;
                return retCode;
            }
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_ReceiveDataBlocking
 * Description   : Perform a blocking UART reception
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_ReceiveDataBlocking(flexio_uart_state_t *state,
                                                    uint8_t * rxBuff,
                                                    uint32_t rxSize,
                                                    uint32_t timeout)
{
    flexio_status_t status;

    /* mark transfer as blocking */
    if (state->driverType != FLEXIO_DRIVER_TYPE_POLLING)
    {
        state->blocking = true;
    }
    /* Call FLEXIO_UART_DRV_ReceiveData to start transfer */
    status = FLEXIO_UART_DRV_ReceiveData(state, rxBuff, rxSize);
    if (status != FLEXIO_STATUS_SUCCESS)
    {
        /* Transfer could not be started */
        state->blocking = false;
        return status; 
    }

    /* Wait for transfer to end */
    return FLEXIO_UART_DRV_WaitTransferEnd(state, timeout);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_TransferAbort
 * Description   : Aborts a non-blocking UART transfer
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_TransferAbort(flexio_uart_state_t *state)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
#endif

    /* Check if driver is busy */
    if (state->driverIdle)
    {
        return FLEXIO_STATUS_FAIL;
    }

    state->status = FLEXIO_STATUS_ABORTED;
    FLEXIO_UART_DRV_StopTransfer(state);

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_GetStatus
 * Description   : Get the status of the current non-blocking UART transaction
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_GetStatus(flexio_uart_state_t *state, uint32_t *bytesRemaining)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
#endif

    if ((!state->driverIdle) && (state->driverType == FLEXIO_DRIVER_TYPE_POLLING))
    {
        /* In polling mode advance the UART transfer here */
        FLEXIO_UART_DRV_CheckStatus(state);
    }

    if (bytesRemaining != NULL)
    {
        *bytesRemaining = state->remainingBytes;
    }

    if (!state->driverIdle)
    {
        return FLEXIO_STATUS_BUSY;
    }
    else
    {
        return state->status;
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_SetRxBuffer
 * Description   : Provide a buffer for receiving data.
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_SetRxBuffer(flexio_uart_state_t *state,
                                            uint8_t * rxBuff,
                                            uint32_t rxSize)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(rxSize > 0U);
#endif
    state->data = rxBuff;
    state->remainingBytes = rxSize;

    return FLEXIO_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_UART_DRV_SetTxBuffer
 * Description   : Provide a buffer for transmitting data.
 *
 *END**************************************************************************/
flexio_status_t FLEXIO_UART_DRV_SetTxBuffer(flexio_uart_state_t *state,
                                            uint8_t * txBuff,
                                            uint32_t txSize)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state != NULL);
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(txSize > 0U);
#endif
    state->data = (uint8_t *)txBuff;
    state->remainingBytes = txSize;

    return FLEXIO_STATUS_SUCCESS;
}


/*******************************************************************************
 * EOF
 ******************************************************************************/
